where-can-i-watch-it/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "movie_id", "author_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sucks"], ["movie_id", 1], ["author_name", "test"], ["created_at", "2019-05-05 22:40:46.974852"], ["updated_at", "2019-05-05 22:40:46.974852"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.movie_id = params[:movie_id]
    @comment.author_name = current_user.email[/[^@]+/]

    @comment.save