where-can-i-watch-it/app/controllers/favorite_movies_controller.rb

  def create
    @movie = Movie.find(params[:movie_id] || params[:id])
    if Favorite.create(favorited: @movie, user: current_user)
        @movie.favcounter += 1
        @movie.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "favorites" ("favorited_id", "favorited_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["favorited_id", 1], ["favorited_type", "Movie"], ["user_id", 3], ["created_at", "2019-04-04 21:49:47.769645"], ["updated_at", "2019-04-04 21:49:47.769645"]]
UPDATE "movies" SET "favcounter" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["favcounter", 1], ["updated_at", "2019-04-17 20:19:30.372309"], ["id", 1]]

  def destroy
    @movie = Movie.find(params[:movie_id] || params[:id])
    @movie.favcounter -= 1
    @movie.save
    Favorite.where(favorited_id: @movie.id, user_id: current_user.id).first.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "favcounter" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["favcounter", 0], ["updated_at", "2019-04-17 20:19:34.098430"], ["id", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."favorited_id" = ? AND "favorites"."user_id" = ?  ORDER BY "favorites"."id" ASC LIMIT 1  [["favorited_id", 1], ["user_id", 3]]