where-can-i-watch-it/app/controllers/movies_controller.rb

  def index

    if clear_filters?
        params[:sort_by] = nil
        session[:sort_by] = nil
        params[:search] = nil
        session[:search_movie] = nil
        params[:ratings] = nil
        session[:ratings] = nil

    end

    @movies = Movie.search(@search_movie)
---
SELECT "movies".* FROM "movies" WHERE (lower(title) LIKE '%mha%')  ORDER BY title ASC

    end

    if @ratings and @sort_by
      @movies = Movie.where(:rating => @ratings.keys).order(@sort_by)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('Hulu', 'Netflix', 'PrimeVideo', 'YouTube') AND (title LIKE '%%')  ORDER BY title

  def popular

    if params[:search]
        redirect_to movies_path(:search => params[:search])
    end

    @movies = Movie.all

    @movies = Movie.order('favcounter DESC')
---
SELECT "movies".* FROM "movies"  ORDER BY favcounter DESC
SELECT "movies".* FROM "movies" WHERE "movies"."favcounter" = ?  [["favcounter", 1]]

  def recent_releases

  if params[:search]
        redirect_to movies_path(:search => params[:search])
    end

  @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (release_date >= '2019-04-05')