where-can-i-watch-it/app/views/movies/show.html.erb


        <h3>Comments (<%= @movie.comments.size %>)</h3>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 1]]